<?php

echo "<a href=\"../\"><h1>Главная страница</h1></a>";
//Практика 54.1
$a = ['a', 'b', 'c'];
echo '54.1: ';
echo $a;
var_dump($a);
echo '<br>';
//Практика 55.1
echo "55.1: $a[0] $a[1] $a[2] <br>";
//Практика 55.2
$arr = ['a', 'b', 'c', 'd', 'e'];
echo "55.2: $arr[0] + $arr[1] + $arr[2] + $arr[3] <br>";
//Практика 55.3
$arr = [1, 2, 3, 4, 5];
echo '55.3: ' . ($arr[0] + $arr[1] + $arr[2] + $arr[3] + $arr[4]) . "<br>";
//Практика 55.4
$arr = [2, 5, 3, 9];
echo '55.4: ' . ($arr[0] * $arr[1] + $arr[2] * $arr[3]) . "<br>";
//Практика 56.1
$user = [
    'name' => 'Алексей',
    'surname' => 'Алексеев',
    'patronymic' => 'Алексеевич',
];
echo '56.1: ' . $user['name'] . " " . $user['surname'] . " " . $user['patronymic'] . "<br>";
//Практика 56.2
$week = [
    1 => 'Понедельник',
    2 => 'Вторник',
    3 => 'Среда',
    4 => 'Четверг',
    5 => 'Пятница',
    6 => 'Суббота',
    7 => 'Воскресенье',
];
echo '56.2: ';
var_dump($week);
echo "<br>";
//Практика 57.1
$month = [
    1 => 'Январь',
    'Февраль',
    'Март',
    'Апрель',
    'Май',
    'Июнь',
    'Июль',
    'Август',
    'Сентябрь',
    'Октябрь',
    'Ноябрь',
    'Декабрь'
];
echo '57.1: ';
var_dump($month);
echo "<br>";
//Практика 59.1
$arr = ['a', 'b', 'c', 'd', 'e'];
echo '59.1: ' . count($arr) . "<br>";
//Практика 59.2
$arr = ['a' => 1, 'b' => 2, 'c' => 3, 'd' => 4];
echo '59.2: ' . count($arr) . "<br>";
//Практика 60.1
$arr = ['a' => 1, 'b' => 2, 'c' => 3];
echo '60.1: ';
$arr['a'] = 2;
$arr['b'] = 3;
$arr['c'] = 4;
var_dump($arr);
echo "<br>";
//Практика 61.1
$arr = ['a' => 1, 'b' => 2, 'c' => 3];
echo '61.1: ';
$arr['a'] += 3;
$arr['b'] += 3;
$arr['c'] += 3;
var_dump($arr);
echo "<br>";
//Практика 63.1
$arr = [];
echo '63.1: ';
$arr[] = 1;
$arr[] = 2;
$arr[] = 3;
$arr[] = 4;
$arr[] = 5;
var_dump($arr);
echo "<br>";
//Практика 63.2
$arr = [1, 2, 3];
echo '63.2: ';
$arr[] = 4;
$arr[] = 5;
var_dump($arr);
echo "<br>";
//Практика 64.1
$arr = [];
echo '64.1: ';
$arr['year'] = 2026;
$arr['month'] = 1;
$arr['day'] = 5;
var_dump($arr);
echo "<br>";
//Практика 65.1
$arr = [1, 2, 3, 4, 5];
$key1 = 1;
$key2 = 2;
echo '65.1: ' . ($arr[$key1] + $arr[$key1]) . "<br>";
//Практика 65.2
$arr = ['a' => 1, 'b' => 2, 'c' => 3];
$key = 'b';
echo '65.2: ' . $arr[$key] . "<br>";