<?php

echo "<a href=\"../\"><h1>Главная страница</h1></a>";
//Практика 14.1
$num = 123;
echo '14.1: ' . $num . "<br>";
//Практика 15.1
$a = 10;
echo '15.1: ' . "$a ";
$a = 20;
echo $a . "<br>";
//Практика 16.1
$a = 1 + 2 + 3;
echo '16.1: ' . $a . "<br>";
//Практика 17.1
$a = 10;
$b = 2;
echo '17.1: ' . ($a + $b) . " ";
echo $a - $b . " ";
echo $a * $b . " ";
echo $a / $b . "<br>";
//Практика 17.2
$c = 10;
$d = 5;
$res = $c + $d;
echo '17.2: ' . $res . "<br>";
//Практика 17.3
$a = 1;
$b = 2;
$c = 3;
echo '17.3: ' . ($a + $b + $c) . "<br>";
//Практика 17.4
$a = 10;
$b = 5;
$c = $a - $b;
$d = 7;
$res = $c + $d;
echo '17.4: ' . $res . "<br>";
//Практика 22.1
$a = 1.5;
$b = 0.75;
echo '22.1: ' . ($a + $b) . "<br>";
//Практика 23.1
$a = -100;
echo '23.1: ' . $a . "<br>";
//Практика 23.2
$a = 111;
echo '23.2: ' . -$a . "<br>";
//Практика 24.1
$a = 10;
$b = 3;
echo '24.1: ' . $a % $b . "<br>";
//Практика 25.1
$a = 2;
$n = 10;
echo '25.1: ' . $a ** $n . "<br>";
//Практика 28.1
$str1 = 'hello';
echo '28.1: ' . $str1 . "<br>";
//Практика 28.2
$str1 = 'abc';
$str2 = 'def';
echo '28.2: ' . $str1 . $str2 . "<br>";
//Практика 29.1
$str1 = 'hello';
$str2 = 'world';
echo '29.1: ' . $str1 . ' ' . $str2 . "<br>";
//Практика 30.1
$str1 = 'hello';
echo '30.1: ' . strlen($str1) . "<br>";
//Практика 31.1
$str1 = 'Здравствуйте';
echo '31.1: ' . mb_strlen($str1) . "<br>";
//Практика 32.1
echo '32.1: ' . '<i>Программист - лучшая профессия!</i>' . "<br>";
//Практика 32.2
echo '32.2: ' . '<br>1<br>2<br>3<br>4<br>5<br>6<br>7<br>8<br>9' . '<br>';
//Практика 33.1
echo '33.1: ' . '<img src="https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTLjsszBhTBpRpAsQX6n2oVmreBLg4MBQUjgA&s" alt="Esc">' . '<br>';
//Практика 33.2
echo '33.2: ' . '<input value="Какой-то текст">' . '<br>';
//Практика 33.3
echo '33.3: ' . '<textarea>Какой-то текст</textarea>' . '<br>';
//Практика 34.1
$isHuman = true;
echo '34.1: ';
var_dump($isHuman);
echo "<br>";
//Практика 34.2
$isHuman = false;
echo '34.2: ';
var_dump($isHuman);
echo "<br>";
//Практика 35.1
$test = null;
echo '35.1: ';
var_dump($test);
echo "<br>";
//Практика 35.2
echo '35.2: ';
var_dump($test4);
echo "<br>";
//Практика 37.1
$a = 1;
$b = 2;
$c = 3;
echo '37.1: ' . $a . $b . $c . "<br>";
//Практика 38.1
echo '38.1: ' . 3 . 4 . "<br>";
//Практика 39.1
$test = '12345';
echo '39.1: ';
var_dump((int)$test);
echo "<br>";
//Практика 40.1
$test = '12.345';
echo '40.1: ';
var_dump((float)$test);
echo "<br>";
//Практика 41.1
$test = '12.345';
echo '41.1: ';
var_dump((int)$test);
echo "<br>";
//Практика 42.1
$test = 12345;
echo '42.1: ';
var_dump((string)$test);
echo "<br>";
//Практика 42.2
$test = 12.345;
echo '42.2: ';
var_dump((string)$test);
echo "<br>";
//Практика 43.1
$str = 'abcde';
echo '43.1: ' . "$str[0] $str[2] $str[4]" . "<br>";
//Практика 43.2
echo '43.2: ' . "$str[-1]" . "<br>";
//Практика 43.3
$strRev = $str[-1] . $str[-2] . $str[-3] . $str[-4] . $str[-5];
echo '43.3: ' . $strRev . "<br>";
//Практика 43.4
$num = 3;
echo '43.4: ' . $str[$num] . "<br>";
//Практика 44.1
$str = '12345';
echo '44.1: ' . ($str[0] + $str[1] + $str[2] + $str[3] + $str[4]) . "<br>";
//Практика 45.1
$num = 12345;
$str = (string)$num;
echo '45.1: ' . ($str[0] + $str[1] + $str[2] + $str[3] + $str[4]) . "<br>";
//Практика 45.2
echo '45.2: ' . ($str[0] * $str[1] * $str[2] * $str[3] * $str[4]) . "<br>";
//Практика 45.3
echo '45.3: ' . $str[-1] . $str[-2] . $str[-3] . $str[-4] . $str[-5] . "<br>";
//Практика 47.1
$num = 47;
$num += 7;
$num -= 18;
$num *= 10;
$num /= 15;
echo '47.1: ' . $num . "<br>";
//Практика 47.2
$str = 'a';
$str .= 'b';
$str .= 'c';
echo '47.2: ' . $str . "<br>";
//Практика 48.1
$num = 10;
$num++;
$num++;
$num--;
echo '48.1: ' . $num . "<br>";
//Практика 51
echo '51.1: Количество секунд в сутках - ' . 24 * 60 * 60 . "<br>";
echo '51.2: Количество секунд в 30 сутках - ' . 30 * 24 * 60 * 60 . "<br>";
echo '51.3: Количество секунд в году - ' . 365 * 24 * 60 * 60 . "<br>";
echo '51.4: Количество минут в сутках - ' . 24 * 60 . "<br>";
echo '51.5: Количество минут в году - ' . 365 * 24 * 60 . "<br>";
echo '51.6: Количество байт в мегабайте - ' . 1000 * 1000 . "<br>";
echo '51.7: Количество байт в гигабайте - ' . 1000 * 1000 * 1000 . "<br>";
echo '51.8: Количество байт в 10 гигабайтах - ' . 10 * 1000 * 1000 * 1000 . "<br>";
echo '51.9: Количество байт в терабайте - ' . 1000 * 1000 * 1000 * 1000 . "<br>";
echo '51.10: Количество килобайт в терабайте - ' . 1000 * 1000 * 1000 . "<br>";
//Практика 52.1
$r = 10;
$s = $r ** 2 * 3.14;
echo '52.1: Площадь круга r = 10, S = ' . $s . "<br>";
//Практика 52.2
$a = 2;
$s = $a ** 2;
echo '52.2: Площадь квадрата a = 2, S = ' . $s . "<br>";
//Практика 52.3
$a = 2;
$b = 3;
$s = $a * $b;
echo '52.3: Площадь прямоугольника a = 2, b = 3, S = ' . $s . "<br>";
//Практика 52.4
$p = ($a + $b) * 2;
echo '52.4: Периметр прямоугольника a = 2, b = 3, P = ' . $p . "<br>";
//Практика 52.5
$tc = 36.6;
echo '52.5: Из шкалы Цельсия в шкалу Фаренгейта tc(36.6) = ' . ($tc * (9 / 5) + 32) . "<br>";
//Практика 52.6
$tf = 96;
echo '52.6: Из шкалы Фаренгейта в шкалу Цельсия tf(90) = ' . (($tf - 32) * (5 / 9)) . "<br>";