<?php
//Практика 14.1
$num = 123;
echo $num."\n";
//Практика 15.1
$a = 10;
echo "$a ";
$a = 20;
echo $a."\n";
//Практика 16.1
$a = 1 + 2 + 3;
echo $a."\n";
//Практика 17.1
$a = 10;
$b = 2;
echo $a + $b." ";
echo $a - $b." ";
echo $a * $b." ";
echo $a / $b."\n";
//Практика 17.2
$c = 10;
$d = 5;
$res = $c + $d;
echo $res."\n";
//Практика 17.3
$a = 1;
$b = 2;
$c = 3;
echo $a + $b + $c."\n";
//Практика 17.4
$a = 10;
$b = 5;
$c = $a - $b;
$d = 7;
$res = $c + $d;
echo $res."\n";
//Практика 22.1
$a = 1.5;
$b = 0.75;
echo $a + $b."\n";
//Практика 23.1
$a = -100;
echo $a."\n";
//Практика 23.2
$a = 111;
echo -$a."\n";