<?php
//Практика 14.1
$num = 123;
echo '14.1: '.$num."<br>";
//Практика 15.1
$a = 10;
echo '15.1: '."$a ";
$a = 20;
echo $a."<br>";
//Практика 16.1
$a = 1 + 2 + 3;
echo '16.1: '.$a."<br>";
//Практика 17.1
$a = 10;
$b = 2;
echo '17.1: '.$a + $b." ";
echo $a - $b." ";
echo $a * $b." ";
echo $a / $b."<br>";
//Практика 17.2
$c = 10;
$d = 5;
$res = $c + $d;
echo '17.2: '.$res."<br>";
//Практика 17.3
$a = 1;
$b = 2;
$c = 3;
echo '17.3: '.$a + $b + $c."<br>";
//Практика 17.4
$a = 10;
$b = 5;
$c = $a - $b;
$d = 7;
$res = $c + $d;
echo '17.4: '.$res."<br>";
//Практика 22.1
$a = 1.5;
$b = 0.75;
echo '22.1: '.$a + $b."<br>";
//Практика 23.1
$a = -100;
echo '23.1: '.$a."<br>";
//Практика 23.2
$a = 111;
echo '23.2: '.-$a."<br>";
//Практика 24.1
$a = 10;
$b = 3;
echo '24.1: '.$a % $b."<br>";
//Практика 25.1
$a = 2;
$n = 10;
echo '25.1: '.$a ** $n."<br>";
//Практика 28.1
$str1 = 'hello';
echo '28.1: '.$str1."<br>";
//Практика 28.2
$str1 = 'abc';
$str2 = 'def';
echo '28.2: '.$str1.$str2."<br>";
//Практика 29.1
$str1 = 'hello';
$str2 = 'world';
echo '29.1: '.$str1.' '.$str2."<br>";
//Практика 30.1
$str1 = 'hello';
echo '30.1: '.strlen($str1)."<br>";
//Практика 31.1
$str1 = 'Здравствуйте';
echo '31.1: '.mb_strlen($str1)."<br>";
//Практика 32.1
 echo '32.1: '.'<i>Программист - лучшая профессия!</i>'."<br>";
 //Практика 32.2
echo '32.2: '.'<br>1<br>2<br>3<br>4<br>5<br>6<br>7<br>8<br>9'.'<br>';
//Практика 33.1
echo '33.1: '.'<img src="https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTLjsszBhTBpRpAsQX6n2oVmreBLg4MBQUjgA&s">'.'<br>';
//Практика 33.2
echo '33.2: '.'<input value="Какой-то текст">'.'<br>';
//Практика 33.3
echo '33.3: '.'<textarea>Какой-то текст</textarea>'.'<br>';
