<?php

echo "<a href='../'><h1>Главная страница</h1></a>";
date_default_timezone_set("Europe/Samara");
//Практика 182.1
echo '182.1: ' . time() . "<br>";
//Практика 182.2
echo '182.1: ' . mktime(0, 0, 0, 3, 1, 2025) . "<br>";
//Практика 182.3
echo '182.3: ' . mktime(0, 0, 0, 12, 31, 2026) . "<br>";
//Практика 182.4
echo '182.4: ' . time() - mktime(13, 12, 59, 3, 15, 2000) . "<br>";
//Практика 182.5
$time7h23m = mktime(7, 23, 48);
$diff_hours = (time() - $time7h23m) / 3600;
echo '182.5: ' . round($diff_hours, 2) . " часов <br>";
//Практика 183.1
echo '183.1:  Год - ' . date('Y') . " Месяц -  " .
    date('m') . " День - " .
    date('d') . " Час - " .
    date('H') . " Минут - " .
    date('i') . " Секунд - " .
    date('s') . "<br>";
//Практика 183.2
echo '183.2: ' . date('Y-m-d') . "<br>";
//Практика 183.3
echo '183.3: ' . date('d-m-Y') . "<br>";
//Практика 183.4
echo '183.4: ' . date('d-m-Y H:i:s') . "<br>";
//Практика 183.5
echo '183.5: ' . date('d.m.Y', mktime(0, 0, 0, 2, 12, 2025)) . "<br>";
//Практика 183.6
$days = [
    'Воскресенье',
    'Понедельник',
    'Вторник',
    'Среда',
    'Четверг',
    'Пятница',
    'Суббота'
];
echo '183.6: ' . $days[date('w')] . "<br>";
//Практика 183.7
$months = [
    1 => 'Январь',
    2 => 'Февраль',
    3 => 'Март',
    4 => 'Апрель',
    5 => 'Май',
    6 => 'Июнь',
    7 => 'Июль',
    8 => 'Август',
    9 => 'Сентябрь',
    10 => 'Октябрь',
    11 => 'Ноябрь',
    12 => 'Декабрь'
];
echo '183.7: ' . $months[date('n')] . "<br>";
//Практика 183.8
echo '183.8: ' . date('t', mktime(0, 0, 0, 2, 1, 2026)) . "<br>";